In [1]:
ls

 Volume in drive C is OS
 Volume Serial Number is 5C8B-CE85

 Directory of C:\Users\khana

08-11-2023  07:58    <DIR>          .
07-11-2023  14:50    <DIR>          ..
07-11-2023  15:46    <DIR>          .anaconda
07-11-2023  15:46    <DIR>          .conda
07-11-2023  15:47                25 .condarc
07-11-2023  15:46    <DIR>          .continuum
08-11-2023  07:58    <DIR>          .ipynb_checkpoints
07-11-2023  15:49    <DIR>          .ipython
07-11-2023  15:47    <DIR>          .jupyter
07-11-2023  00:34    <DIR>          .vscode
07-11-2023  00:50             6,912 -1.14-windows.xml
07-11-2023  15:46    <DIR>          anaconda3
07-11-2023  12:02    <DIR>          Contacts
08-11-2023  07:39    <DIR>          Desktop
08-11-2023  07:45    <DIR>          Documents
08-11-2023  07:56    <DIR>          Downloads
07-11-2023  12:02    <DIR>          Favorites
08-11-2023  07:57    <DIR>          ineuron
07-11-2023  12:02    <DIR>          Links
07-11-2023  12:02    <DIR>          Music
08-11-2023  07:12    <DIR>          OneDrive
07-11-2023  13:50    <DIR>          Pictures
07-11-2023  10:24    <DIR>          Programs
08-11-2023  07:54               313 samle.csv
07-11-2023  12:02    <DIR>          Saved Games
07-11-2023  12:13    <DIR>          Searches
08-11-2023  07:58                72 Untitled.ipynb
07-11-2023  00:58    <DIR>          Videos
               4 File(s)          7,322 bytes
              24 Dir(s)  427,818,962,944 bytes free

In [2]:
import pandas as  pd

In [3]:
pd.read_csv('samle.csv')

      Name   Surname                    Email_ID     Address  Pincode
0  Abdullah     Khan   khanabdulla7862@gmail.com      Mumbai   400102
1     Chand  Salmani  chandsalmani7838@gmail.com  Ghaziabaad   201015
2     Amaan     khan     amaankhan9082@gmail.com      Mumbai   400102
3     Qasim     khan        mdqasim78@gmail.comm  Ghaziabaad   201015
4      Asad  Salamni    salmaniasad@62@gmail.com  Ghaziabaad   201015

In [4]:
pd.read_csv('samle.csv',header = None)

          0        1                           2           3        4
0     Name   Surname                    Email_ID     Address  Pincode
1  Abdullah     Khan   khanabdulla7862@gmail.com      Mumbai   400102
2     Chand  Salmani  chandsalmani7838@gmail.com  Ghaziabaad   201015
3     Amaan     khan     amaankhan9082@gmail.com      Mumbai   400102
4     Qasim     khan        mdqasim78@gmail.comm  Ghaziabaad   201015
5      Asad  Salamni    salmaniasad@62@gmail.com  Ghaziabaad   201015

In [6]:
pd.read_csv('samle.csv', names = ['a','b','c','d','e'])

          a        b                           c           d        e
0     Name   Surname                    Email_ID     Address  Pincode
1  Abdullah     Khan   khanabdulla7862@gmail.com      Mumbai   400102
2     Chand  Salmani  chandsalmani7838@gmail.com  Ghaziabaad   201015
3     Amaan     khan     amaankhan9082@gmail.com      Mumbai   400102
4     Qasim     khan        mdqasim78@gmail.comm  Ghaziabaad   201015
5      Asad  Salamni    salmaniasad@62@gmail.com  Ghaziabaad   201015

In [7]:
pd.read_csv('samle.csv', names = ['a','b','c','d','e','f'])
#NaN- not a number

          a        b                           c           d        e   f
0     Name   Surname                    Email_ID     Address  Pincode NaN
1  Abdullah     Khan   khanabdulla7862@gmail.com      Mumbai   400102 NaN
2     Chand  Salmani  chandsalmani7838@gmail.com  Ghaziabaad   201015 NaN
3     Amaan     khan     amaankhan9082@gmail.com      Mumbai   400102 NaN
4     Qasim     khan        mdqasim78@gmail.comm  Ghaziabaad   201015 NaN
5      Asad  Salamni    salmaniasad@62@gmail.com  Ghaziabaad   201015 NaN

In [8]:
type(pd)

module

In [9]:
df = pd.read_csv('samle.csv')

In [10]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df.dtypes

Name        object
Surname     object
Email_ID    object
Address     object
Pincode      int64
dtype: object

In [13]:
df.head()

      Name   Surname                    Email_ID     Address  Pincode
0  Abdullah     Khan   khanabdulla7862@gmail.com      Mumbai   400102
1     Chand  Salmani  chandsalmani7838@gmail.com  Ghaziabaad   201015
2     Amaan     khan     amaankhan9082@gmail.com      Mumbai   400102
3     Qasim     khan        mdqasim78@gmail.comm  Ghaziabaad   201015
4      Asad  Salamni    salmaniasad@62@gmail.com  Ghaziabaad   201015

In [14]:
df.head(2)

      Name   Surname                    Email_ID     Address  Pincode
0  Abdullah     Khan   khanabdulla7862@gmail.com      Mumbai   400102
1     Chand  Salmani  chandsalmani7838@gmail.com  Ghaziabaad   201015

In [15]:
df.tail(3)

   Name   Surname                  Email_ID     Address  Pincode
2  Amaan     khan   amaankhan9082@gmail.com      Mumbai   400102
3  Qasim     khan      mdqasim78@gmail.comm  Ghaziabaad   201015
4   Asad  Salamni  salmaniasad@62@gmail.com  Ghaziabaad   201015

In [16]:
pd.read_csv('samle.csv',skiprows = [0,1])

   Chand  Salmani chandsalmani7838@gmail.com  Ghaziabaad  201015
0  Amaan     khan    amaankhan9082@gmail.com      Mumbai  400102
1  Qasim     khan       mdqasim78@gmail.comm  Ghaziabaad  201015
2   Asad  Salamni   salmaniasad@62@gmail.com  Ghaziabaad  201015

In [ ]:
#separtion ~ delimeter
pd.read_csv('samle.csv',sep = '@'')

In [17]:
df.columns

Index(['Name ', 'Surname', 'Email_ID', 'Address', 'Pincode'], dtype='object')

In [19]:
df['Email_ID']

0     khanabdulla7862@gmail.com
1    chandsalmani7838@gmail.com
2       amaankhan9082@gmail.com
3          mdqasim78@gmail.comm
4      salmaniasad@62@gmail.com
Name: Email_ID, dtype: object

In [21]:
df['Surname']

0       Khan
1    Salmani
2       khan
3       khan
4    Salamni
Name: Surname, dtype: object

In [22]:
a = df['Email_ID']

In [23]:
type(a)

pandas.core.series.Series

In [24]:
df[['Address','Pincode']]

      Address  Pincode
0      Mumbai   400102
1  Ghaziabaad   201015
2      Mumbai   400102
3  Ghaziabaad   201015
4  Ghaziabaad   201015